IRP/src/Catalogs/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ItemTypes</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.ItemTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>UseSerialLotNumber</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_StockBalanceDetail</name>
  <type>
   <types>EnumRef.DELETE_StockBalanceDetail</types>
  </type>
 </attributes>
 <attributes>
  <name>EachSerialLotNumberIsUnique</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>AlwaysAddNewRowAfterScan</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>SingleRow</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NotUseLineGrouping</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemLocalFullDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemForeignFullDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyLocalFullDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyForeignFullDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>StockBalanceDetailSerialLotNumber</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchBalanceDetailSerialLotNumber</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>StockBalanceDetailSourceOfOrigins</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchBalanceDetailSourceOfOrigins</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AvailableAttributes</name>
  <attributes>
   <name>Attribute</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>AffectPricing</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Required</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowInHTML</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Collection</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RegExpSerialLotNumbersRules</name>
  <attributes>
   <name>RegExp</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>250</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Example</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>250</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ItemTypes</name>
 <enumValues>
  <name>Service</name>
 </enumValues>
 <enumValues>
  <name>Product</name>
 </enumValues>
 <enumValues>
  <name>Certificate</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/ItemTypes/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	EmptyValues = New Array;
	For Each Row In AvailableAttributes Do
		If Not ValueIsFilled(Row.Attribute) Then
			EmptyValues.Add(Row);
		EndIf;
	EndDo;
	For Each Row In EmptyValues Do
		AvailableAttributes.Delete(Row);
	EndDo;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;

	Catalogs.AddAttributeAndPropertySets.SynchronizeItemKeysAttributes();
	Catalogs.AddAttributeAndPropertySets.SynchronizePriceKeysAttributes();

	Catalogs.ItemKeys.SynchronizeAffectPricingMD5ByItemType(ThisObject.Ref);
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If Not ThisObject.IsFolder Then
		ThisObject.Type = Enums.ItemTypes.Product;
	EndIf;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	TableOfAttributes = ThisObject.AvailableAttributes.Unload();
	TableOfAttributes.Columns.Add("Counter");
	TableOfAttributes.FillValues(1, "Counter");
	TableOfAttributes.GroupBy("Attribute", "Counter");

	For Each Row In TableOfAttributes Do
		If Row.Counter <= 1 Then
			Continue;
		EndIf;

		Filter = New Structure("Attribute", Row.Attribute);
		FoundedRows = ThisObject.AvailableAttributes.FindRows(Filter);
		If FoundedRows.Count() Then
			LineNumber = FoundedRows[0].LineNumber;

			CommonFunctionsClientServer.ShowUsersMessage(R().Error_033 + ": " + String(Row.Attribute),
				"AvailableAttributes[" + (LineNumber - 1) + "].Attribute", ThisObject);
			Cancel = True;
		EndIf;
	EndDo;
	CheckDataPrivileged.FillCheckProcessing_Catalog_ItemTypes(Cancel, ThisObject);
EndProcedure
